import React from 'react';
import { createRoot } from 'react-dom/client';
import './style.css'

import App from './App1';

// !----------------------------------------------------= part 1:
// object literal : زمانی که میخواهی در ابجت مقداری قراربدهی میتونی فقط اسم متفیر را 
//     صدا بزنی تا همگان با همون اسم یک مقدار برات بسازه =>
// !----------------------------------------------------=

// !----------------------------------------------------= part 2:
  //!  filter : حلقه میزنه روی ارایه مد نظر و شرط درونش اجرا میکنه و فقط
  //        اونایی که با شرط همخانی داشتن رو برمیگردونم 
// !----------------------------------------------------=

// !----------------------------------------------------= part 3:

// !----------------------------------------------------=








createRoot(document.getElementById("root")).render(<App/>);
